hangcui1201/DSP_TI_TMS320F28379D/F28379D_Projects/libraries/boot_rom/f2838x/rev0/rom_sources/cm/F2838x_ROM/driverlib_cm/memcfg.h
//*****************************************************************************
//
//! Locks the write to the configuration of specified memory sections.
//!
//! \param memSections is the logical OR of the sections to be configured.
//!
//! This function locks writes to the init and test configuration of RAM
//! sections, test configuration of boot ROM & peripheral(EMAC & EtherCAT)
//! memory sections. That means calling MemCfg_setTestMode(),
//! MemCfg_initSections() for a locked RAM section; MemCfg_setTestMode() for
//! locked BootROM & peripheral memory will have no effect until
//! MemCfg_unlockConfig() is called.
//!
//! The \e ramSections parameter is an OR of one of the following sets of
//! indicators:
//! - \b MEMCFG_SECT_C0 through \b MEMCFG_SECT_C1 or \b MEMCFG_SECT_CX_ALL,
//! - \b MEMCFG_SECT_CMTOCPU1MSGRAM0 through \b MEMCFG_SECT_CMTOCPU2MSGRAM1 or
//!   \b MEMCFG_SECT_CMMSGX_ALL,
//! - \b MEMCFG_SECT_S0 through \b MEMCFG_SECT_S4 or \b MEMCFG_SECT_SX_ALL,
//! - \b MEMCFG_SECT_ROM,
//! - \b MEMCFG_SECT_PERIMEM_ALL,
//! - \b OR use \b MEMCFG_SECT_ALL to configure all possible sections.
//!
//! \return None.
//
//*****************************************************************************
extern void
MemCfg_lockConfig(uint32_t memSections);

//*****************************************************************************
//
//! Unlocks the writes to the configuration of specified memory sections.
//!
//! \param memSections is the logical OR of the sections to be configured.
//!
//! This function unlocks writes to the init and test configuration of RAM
//! sections, test configuration of boot ROM & peripheral(EMAC & EtherCAT)
//! memory sections that has been locked using MemCfg_lockConfig().
//!
//! The \e ramSections parameter is an OR of one of the following sets of
//! indicators:
//! - \b MEMCFG_SECT_C0 through \b MEMCFG_SECT_C1 or \b MEMCFG_SECT_CX_ALL,
//! - \b MEMCFG_SECT_CMTOCPU1MSGRAM0 through \b MEMCFG_SECT_CMTOCPU2MSGRAM1 or
//!   \b MEMCFG_SECT_CMMSGX_ALL,
//! - \b MEMCFG_SECT_S0 through \b MEMCFG_SECT_S4 or \b MEMCFG_SECT_SX_ALL,
//! - \b MEMCFG_SECT_ROM,
//! - \b MEMCFG_SECT_PERIMEM_ALL,
//! - \b OR use \b MEMCFG_SECT_ALL to configure all possible sections.
//!
//! \sa MemCfg_lockConfig()
//!
//! \return None.
//
//*****************************************************************************
extern void
MemCfg_unlockConfig(uint32_t memSections);

//*****************************************************************************
//
//! Sets the test mode of the specified memory section.
//!
//! \param memSection is the memory section to be configured.
//! \param testMode is the test mode selected.
//!
//! This function sets the test mode configuration of the RAM section. The
//! \e testMode parameter can take one of the following values:
//! - \b MEMCFG_TEST_FUNCTIONAL,
//! - \b MEMCFG_TEST_WRITE_DATA,
//! - \b MEMCFG_TEST_WRITE_ECC, or
//! - \b MEMCFG_TEST_FUNC_DIAG
//!
//! The \e ramSection parameter is one of the following indicators:
//! - \b MEMCFG_SECT_C0 through \b MEMCFG_SECT_C1 or \b MEMCFG_SECT_CX_ALL,
//! - \b MEMCFG_SECT_CMTOCPU1MSGRAM0 through \b MEMCFG_SECT_CMTOCPU2MSGRAM1 or
//!   \b MEMCFG_SECT_CMMSGX_ALL,
//! - \b MEMCFG_SECT_S0 through \b MEMCFG_SECT_S4 or \b MEMCFG_SECT_SX_ALL,
//! - \b OR use \b MEMCFG_SECT_ROM.
//!
//! \return None.
//
//*****************************************************************************
extern void
MemCfg_setTestMode(uint32_t memSection, MemCfg_TestMode testMode);

//*****************************************************************************
//
//! Starts the initialization the specified RAM sections.
//!
//! \param ramSections is the logical OR of the sections to be initialized.
//!
//! This function starts the initialization of the specified RAM sections. Use
//! MemCfg_getInitStatus() to check if the initialization is done.
//!
//! The \e ramSections parameter is an OR of one of the following sets of
//! indicators:
//! - \b MEMCFG_SECT_C0 through \b MEMCFG_SECT_C1 or \b MEMCFG_SECT_CX_ALL,
//! - \b MEMCFG_SECT_CMTOCPU1MSGRAM0 through \b MEMCFG_SECT_CMTOCPU2MSGRAM1 or
//!   \b MEMCFG_SECT_CMMSGX_ALL,
//! - \b MEMCFG_SECT_S0 through \b MEMCFG_SECT_S4 or \b MEMCFG_SECT_SX_ALL,
//! - \b OR use \b MEMCFG_SECT_ALL to configure all possible sections.
//!
//! \return None.
//
//*****************************************************************************
extern void
MemCfg_initSections(uint32_t ramSections);

//*****************************************************************************
//
//! Get the status of initialized RAM sections.
//!
//! \param ramSections is the logical OR of the sections to be checked.
//!
//! This function gets the initialization status of the RAM sections specified
//! by the \e ramSections parameter.
//!
//! The \e ramSections parameter is an OR of one of the following sets of
//! indicators:
//! - \b MEMCFG_SECT_C0 through \b MEMCFG_SECT_C1 or \b MEMCFG_SECT_CX_ALL,
//! - \b MEMCFG_SECT_CMTOCPU1MSGRAM0 through \b MEMCFG_SECT_CMTOCPU2MSGRAM1 or
//!   \b MEMCFG_SECT_CMMSGX_ALL,
//! - \b MEMCFG_SECT_S0 through \b MEMCFG_SECT_S4 or \b MEMCFG_SECT_SX_ALL,
//! - \b OR use \b MEMCFG_SECT_ALL to configure all possible sections.
//!
//! \note Use MemCfg_initSections() to start the initialization.
//!
//! \return Returns \b true if all the sections specified by \e ramSections
//! have been initialized and \b false if not.
//
//*****************************************************************************
extern bool
MemCfg_getInitStatus(uint32_t ramSections);

//*****************************************************************************
//
//! Forces parity error in the selected memory.
//!
//! \param memTypes is the logical OR of the sections to be tested.
//!
//! This function forces the parity error in the memories specified
//! by the \e memTypes parameter.
//!
//! The \e memTypes parameter is an OR of one of the following sets of
//! indicators:
//! - \b MEMCFG_SECT_ROM,
//! - \b MEMCFG_SECT_PERIMEM_EMAC,
//! - \b MEMCFG_SECT_PERIMEM_ETHERCAT, or
//! - \b OR use \b MEMCFG_SECT_ALL to get status of all possible sections.
//!
//! \return None.
//
//*****************************************************************************
extern void
MemCfg_forceMemError(uint32_t memTypes);

//*****************************************************************************
//
//! Enables test mode for selected peripheral memories.
//!
//! \param memTypes is the logical OR of the memories to be tested.
//!
//! This function enables test mode for selected peripheral memories specified
//! by the \e memTypes parameter.
//!
//! The \e memTypes parameter is an OR of one of the following sets of
//! indicators:
//! - \b MEMCFG_SECT_PERIMEM_EMAC,
//! - \b MEMCFG_SECT_PERIMEM_ETHERCAT, or
//! - \b MEMCFG_SECT_PERIMEM_ALL
//!
//! \return None.
//
//*****************************************************************************
extern void
MemCfg_enablePeriMemTestMode(uint32_t memTypes);

//*****************************************************************************
//
//! Disables the test mode for selected peripheral memories.
//!
//! \param memTypes is the logical OR of the memories to be tested.
//!
//! This function disables test mode for selected peripheral memories specified
//! by the \e memTypes parameter.
//!
//! The \e memTypes parameter is an OR of one of the following sets of
//! indicators:
//! - \b MEMCFG_SECT_PERIMEM_EMAC,
//! - \b MEMCFG_SECT_PERIMEM_ETHERCAT, or
//! - \b MEMCFG_SECT_PERIMEM_ALL
//!
//! \return None.
//
//*****************************************************************************
extern void
MemCfg_disablePeriMemTestMode(uint32_t memTypes);

//*****************************************************************************
//
//! Gets the address location of uncorrectable memory read/write error.
//!
//! \param stsFlag is the error for which address needs to be returned.
//!
//! This function returns the address location of uncorrectable read/write
//! error for the specified error. The parameter \e stsFlag can be any of the
//! \b MEMCFG_UCERR_M4READ, \b MEMCFG_UCERR_M4WRITE, \b MEMCFG_UCERR_EMACREAD,
//! \b MEMCFG_UCERR_EMACWRITE,\b MEMCFG_UCERR_UDMAREAD,
//! \b MEMCFG_UCERR_UDMAWRITE, \b MEMCFG_UCERR_ETHERCATMEMREAD or/and
//! \b MEMCFG_UCERR_EMACMEMREAD values.
//!
//! \return Return address location of uncorrectable read/write error.
//
//*****************************************************************************
extern uint32_t
MemCfg_getUncorrErrorAddress(uint32_t stsFlag);

//*****************************************************************************
//
//! Gets the address location of correctable memory read/write error.
//!
//! \param stsFlag is the error for which address needs to be returned.
//!
//! This function returns the address location of correctable read/write
//! error for the specified error. The param \e stsFlag can take any of the
//! \b MEMCFG_CERR_M4READ, \b MEMCFG_CERR_M4WRITE, \b MEMCFG_CERR_EMACREAD,
//! MEMCFG_CERR_EMACWRITE, \b MEMCFG_CERR_UDMAREAD and/or
//! \b MEMCFG_CERR_UDMAWRITE values.
//!
//! \return Return address location of correctable read/write error.
//
//*****************************************************************************
extern uint32_t
MemCfg_getCorrErrorAddress(uint32_t stsFlag);

//*****************************************************************************
//
//! Gets the bus fault address for the selected bus master.
//!
//! \param busMaster specifies the bus masters for which fault address is to be
//! returned.
//!
//! This function return the bus fault address for selected bus master. The
//! parameter \e busMaster can be any of the following values:
//! \b MEMCFG_BUSMASTER_M4, MEMCFG_BUSMASTER_UDMA, or MEMCFG_BUSMASTER_EMAC.
//!
//! \return Returns bus fault address for the selected bus master.
//
//*****************************************************************************
extern uint32_t
MemCfg_getBusFaultAddress(uint32_t busMaster);

//*****************************************************************************
//
// Close the Doxygen group.
//! @}
//
//*****************************************************************************

//*****************************************************************************
//
// Mark the end of the C bindings section for C++ compilers.
//
//*****************************************************************************
#ifdef __cplusplus
}
#endif

#endif // MEMCFG_H
